{
  "backend/main.mo": "Motoko canister managing user preferences and profiles with access control checks for saving and querying.",
  "feature_evidence.json": "Feature evidence report linking app features to source files, components, and test IDs.",
  "frontend-file-summaries.txt": "Prewritten summaries mapping frontend file paths to short descriptions of their functionality.",
  "frontend/index.css": "Tailwind-based global styles defining OKLCH theme variables and base dark/light modes.",
  "frontend/index.html": "Main HTML entry with mobile-optimized meta tags, app icons, and script loader for the React app.",
  "frontend/src/App.tsx": "App root component providing theme context and rendering the player shell with toast notifications.",
  "frontend/src/components/auth/LoginButton.tsx": "Internet Identity login/logout button handling authentication state and query cache reset.",
  "frontend/src/components/branding/AppLogo.tsx": "Simple component displaying the candy apple logo image with responsive sizing.",
  "frontend/src/components/equalizer/EqualizerPanel.tsx": "UI panel for the 10‑band equalizer with gain sliders, enable toggle, and reset button.",
  "frontend/src/components/equalizer/SpectrumVisualizer.tsx": "Canvas-based frequency spectrum visualizer using Web Audio analyser data with idle and active states.",
  "frontend/src/components/player/FilePickerButton.tsx": "Button and hidden input allowing users to select multiple MP3 files and return them to the parent.",
  "frontend/src/components/player/PlayerShell.tsx": "Main player container rendering tabs for playback and equalizer plus controls, visualizer, playlist, and preference sync.",
  "frontend/src/components/player/PlaylistQueue.tsx": "Displays the track list with buttons to select the active track.",
  "frontend/src/components/player/SeekBar.tsx": "Seek bar slider showing current time and duration and allowing scrubbing.",
  "frontend/src/components/player/TransportControls.tsx": "Play, pause, previous, and next buttons with disabled handling.",
  "frontend/src/components/player/VolumeControl.tsx": "Volume slider with mute toggle and state tracking for previous volume.",
  "frontend/src/components/preferences/PreferenceSyncControls.tsx": "Cloud preference sync card that triggers syncing when authenticated.",
  "frontend/src/components/theme/ThemeSwitcher.tsx": "Dropdown button to switch between predefined UI themes.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to user identity and refreshes dependent queries.",
  "frontend/src/hooks/useAudioPlayer.ts": "Custom audio player hook managing playback, track list, timing, and volume with preference syncing.",
  "frontend/src/hooks/useEqualizer.ts": "Sets up Web Audio API equalizer filters, analyser node, and manages EQ state with preferences.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and provider for Internet Identity authentication, managing identity state, login flow, and status flags.",
  "frontend/src/hooks/useLocalPreferences.ts": "Manages local user preferences in state and persists them to localStorage with update helpers.",
  "frontend/src/hooks/usePreferenceSync.ts": "Synchronizes local preferences with remote backend preferences when authenticated and allows pushing updates remotely.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching and mutating user profiles and preferences via an actor API.",
  "frontend/src/index.css": "Sets up Tailwind base styles and defines custom CSS variables and components for the app’s visual theme.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClient and InternetIdentity providers before rendering App.",
  "frontend/src/theme/ThemeProvider.tsx": "Applies theme color variables based on user preferences and exposes a context to change the active theme.",
  "frontend/src/theme/themes.ts": "Defines available UI themes with color mappings and provides a lookup function by theme id.",
  "frontend/src/utils/formatTime.ts": "Formats a number of seconds into a mm:ss time string.",
  "frontend/src/utils/urlParams.ts": "Provides helpers for reading, persisting, and clearing URL and session parameters, supporting hash and query routing.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom colors, components, utilities, and plugins using CSS variables for theming.",
  "project_state.json": "Holds the project’s schema version, app summary, and a list of implemented features with their IDs, titles, requirement links, and versions. Captures the functional scope of an iOS‑focused MP3 player web app with theming, equalizer, assets, and optional backend preferences."
}